Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisSurfaceTilt Property

---

"Tilt"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceTilt { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceTilt As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceTilt {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisSurfaceTilt : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace